In [2]:
import pandas as pd

In [12]:
orders_data = {'OrderID': [1, 2, 3, 4, 5],'CustomerID': [101, 102, 103, 104, 101],'Product': ['A', 'B', 'A', 'C', 'B'],'Quantity': [2, 1, 4, 2, 3]}

{'OrderID': [1, 2, 3, 4, 5],
 'CustomerID': [101, 102, 103, 104, 101],
 'Product': ['A', 'B', 'A', 'C', 'B'],
 'Quantity': [2, 1, 4, 2, 3]}

In [16]:
orders = pd.DataFrame(orders_data)

In [18]:
orders

   OrderID  CustomerID Product  Quantity
0        1         101       A         2
1        2         102       B         1
2        3         103       A         4
3        4         104       C         2
4        5         101       B         3

In [20]:
customers_data = {'CustomerID': [101, 102, 103, 104],'Name': ['Alice', 'Bob', 'Charlie', 'David'],'Location': ['New York', 'Los Angeles', 'Chicago', 'Houston']}

In [22]:
customers_data

{'CustomerID': [101, 102, 103, 104],
 'Name': ['Alice', 'Bob', 'Charlie', 'David'],
 'Location': ['New York', 'Los Angeles', 'Chicago', 'Houston']}

In [26]:
customers = pd.DataFrame(customers_data)

In [28]:
customers

   CustomerID     Name     Location
0         101    Alice     New York
1         102      Bob  Los Angeles
2         103  Charlie      Chicago
3         104    David      Houston

In [30]:
merged_df = pd.merge(orders, customers, on='CustomerID')

In [32]:
merged_df

   OrderID  CustomerID Product  Quantity     Name     Location
0        1         101       A         2    Alice     New York
1        2         102       B         1      Bob  Los Angeles
2        3         103       A         4  Charlie      Chicago
3        4         104       C         2    David      Houston
4        5         101       B         3    Alice     New York

In [37]:
total_quantity_by_location = merged_df.groupby('Location')['Quantity'].sum()

In [39]:
total_quantity_by_location

Location
Chicago        4
Houston        2
Los Angeles    1
New York       5
Name: Quantity, dtype: int64

In [41]:
customer_with_highest_orders = merged_df['CustomerID'].value_counts().idxmax()

In [43]:
customer_with_highest_orders

np.int64(101)

In [45]:
merged_df['Total_Quantity'] = merged_df.groupby('Product')['Quantity'].transform('cumsum')

In [47]:
merged_df

   OrderID  CustomerID Product  Quantity     Name     Location  Total_Quantity
0        1         101       A         2    Alice     New York               2
1        2         102       B         1      Bob  Los Angeles               1
2        3         103       A         4  Charlie      Chicago               6
3        4         104       C         2    David      Houston               2
4        5         101       B         3    Alice     New York               4

In [49]:
filtered_df = merged_df[merged_df['Product'].isin(['A', 'B'])]

In [51]:
filtered_df

   OrderID  CustomerID Product  Quantity     Name     Location  Total_Quantity
0        1         101       A         2    Alice     New York               2
1        2         102       B         1      Bob  Los Angeles               1
2        3         103       A         4  Charlie      Chicago               6
4        5         101       B         3    Alice     New York               4